'use strict'
/*
let age = prompt('Ваш возраст?','');
if (age >= 14 && age <= 90){
    alert('Ваш возраст в диапазоне между 14 и 90');
} else {
 alert('Ваш возраст вне диапазона 14 - 90');   
}
*/
/*
let age = prompt('Ваш возраст?','');
if (!(age >= 14 && age <= 90)){
    alert('Ваш возраст вне диапазона 14 - 90');
} else {
 alert('Ваш возраст в диапазоне между 14 и 90');   
}
*/
/*
let age = prompt('Ваш возраст?','');
if (age < 14 || age > 90) {
    alert('Ваш возраст вне диапазона 14 - 90');  
} else {
    alert('Ваш возраст в диапазоне между 14 и 90');
}
*/

let user = prompt("Кто там?","");

if (user == "Админ") {
    let pass = prompt("Введите пароль","");
    if (pass == 'Я Главный') {
        alert('Здравствуйте');
    } else if (pass != 'Я Главный' && pass != null) {
        alert('Неверный пароль');
    } else {
        alert('Ввод отменен');
    }
} else if (user != "Админ" &&  null != null) {
    alert('Я вас не знаю');
} else {
    alert('Ввод отменен');
}

